Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/birth_family_relationships/getting_married/pre_nuptial_agreements.html.txt.tmx
Source language: en
Languages: ga

source: A pre-nuptial agreement (also called an ante-nuptial agreement) is an agreement entered into by a couple before they get married
ga: Comhaontú ina n-iontrálann lánúin sula bpóstar iad is ea comhaontú réamhphósta

source: In some cases a couple may enter into a post-nuptial agreement after they get married
ga: I roinnt cásanna, féadfaidh lánúin iontráil i gcomhaontú réamhphósta tar éis go bpóstar iad

source: Pre-nuptial agreements vary according to each couple’s particular circumstances but generally they make provision for financial and property matters, and other issues, following the breakdown of the marriage
ga: Is éagsúil do chomhaontuithe réamhphósta de réir cúinsí áirithe gach lánúine ach, go ginearálta, déanann siad foráil le haghaidh ábhair airgeadais agus mhaoine, agus saincheisteanna eile, tar éis go dteipeann ar an bpósadh

source: They can cover issues such as lump sum payments, pensions, maintenance and custody
ga: Féadfaidh siad saincheisteanna a chuimsiú, ar nós íocaíochtaí cnapshuime, pinsean, cothabhála agus caomhnóireachta

source: A couple enters into an agreement in order to try and avoid a dispute if they separate
ga: Iontrálann lánúin isteach i gcomhaontú d’fhonn iarracht a dhéanamh chun díospóid a sheachaint má fhaigheann siad idirscaradh óna chéile

source: Some pre-nuptial agreements cover issues arising during the marriage
ga: Cuimsíonn roinnt comhaontuithe réamhphósta saincheisteanna a eascraíonn le linn an phósta

source: Under Section 113 of the Succession Act 1965 a spouse can renounce his/her legal right share in a pre-nuptial agreement
ga: Faoi Alt 113 den Acht Comharbais, 1965, féadfaidh céile a c(h)uid cearta dlíthiúla a thréigean i gcomhaontú réamhphósta

source: Enforcing a pre-nuptial agreement
ga: Comhaontú réamhphósta a fhorfheidhmiú

source: There is nothing in Irish law which stops a couple intending to marry from signing a pre-nuptial agreement
ga: Níl aon rud i ndlí na hÉireann a chuireann stop ar lánúin, a bhfuil sé beartaithe acu iad féin a phósadh, ó chomhaontú réamhphósta a shíniú

source: Such agreements can serve as guides for the courts in judicial separation and divorce cases, however, the courts are not obliged to enforce them
ga: Feidhmíonn na comhaontuithe seo mar threoracha do na cúirteanna i gcásanna idirscartha bhreithiúnaigh agus colscartha, ach níl aon dualgas ar na cúirteanna iad a chur i bhfeidhm

source: Only pre-nuptial agreements entered into following independent legal advice for both parties are likely to be taken into account
ga: Ní dócha go gcuirfear san áireamh ach comhaontuithe réamhphósta inar iontráladh tar éis comhairle neamhspleách dlí a chur ar an mbeirt pháirtithe

source: The court would have to be satisfied that there had been a complete disclosure of assets before the agreement was signed
ga: Bheadh ar an gcúirt bheith sásta go ndearnadh na sócmhainní a nochtadh ina n-iomláine sular síníodh an comhaontú

source: It is also advisable for the agreement to provide for reviews:
ga: Ina theannta sin, moltar go soláthraíonn an comhaontú athbhreithnithe sna cásanna a leanas:

source: • If there is a major change in circumstances
ga: • Má tháinig mórathrú ar chúinsí

source: Study Group on Pre-nuptial Agreements
ga: An Grúpa Staidéir ar Chomhaontuithe Réamhphósta

source: In December 2006 the Government set up a group to study and report on the operation of the law with respect to pre-nuptial agreements since the introduction of divorce in 1996, taking into account constitutional requirements
ga: I Nollaig 2006, bhunaigh an Rialtas grúpa chun staidéar agus tuairisciú a dhéanamh ar fheidhmiú an dlí maidir le comhaontuithe réamhphósta ó tugadh colscaradh isteach i 1996, agus na ceanglais bhunreachta á gcur san áireamh

source: In April 2007 the Report of the Study Group on Pre-nuptial Agreements (pdf) was published
ga: In Aibreán 2007, foilsíodh Tuarascáil an Ghrúpa Staidéir ar Chomhaontuithe Réamhphósta (pdf)

source: The Study Group held that pre-nuptial agreements were enforceable and capable of variation under existing Irish legislation
ga: Mhaígh an Grúpa Staidéir go raibh comhaontuithe réamhphósta infhorfheidhmithe agus go bhféadfaidís bheith éagsúil óna chéile faoi reachtaíocht reatha na hÉireann

source: The weight to be attached to an agreement is determined by the courts in the light of the requirement for proper provision and the relevant statutory criteria, for example, Section 20(2) of the Family Law (Divorce) Act 1996
ga: Deimhníonn na cúirteanna an tábhacht a bhaineann le comhaontú i bhfianaise an cheanglais le haghaidh foráil cheart agus na gcritéar ábhartha reachtúil, mar shampla, Alt 20(2) den Acht um an Dlí Teaghlaigh, (Colscaradh), 1996

source: The report recommended that pre-nuptial agreements be legislated for by way of introducing a new Section 16(2)A of the Family Law Act 1995 and new Section 20(3)A of the Family Law (Divorce) Act 1996 so that the courts would be required to have regard to existing pre-nuptial agreements when making ancillary relief orders in judicial separation and divorce proceedings
ga: Mhol an tuarascáil go reachtófaí na comhaontuithe réamhphósta trí Alt 16(2)A nua den Acht um an Dlí Teaghlaigh, 1995 a thabhairt isteach, mar aon le hAlt 20(3)A den Acht um an Dlí Teaghlaigh (Colscaradh), 1996 ionas go gceanglófaí ar na cúirteanna aird a bheith ar na comhaontuithe reatha réamhphósta agus orduithe coimhdeacha faoisimh á ndéanamh acu in imeachtaí idirscartha bhreithiúnaigh agus colscartha

source: The report also recommended that the legislation should contain procedural guidelines
ga: Anuas air sin, moladh sa tuarascáil gur cheart don reachtaíocht treoirlínte maidir le nós imeachta a chuimsiú

source: A pre-nuptial agreement would have to comply with general contractual principles and it recommended that for it to be an enforceable agreement it must be:
ga: Bheadh ar chomhaontú réamhphósta na prionsabail ghinearálta chonarthacha a chomhlíonadh agus moladh nach mór do chomhaontú infhorfheidhmithe bheith:

source: • In writing, signed and witnessed
ga: • I scríbhinn, sínithe agus duine bheith mar fhinné air

source: • Made after each party has received separate legal advice
ga: • A bheith déanta tar éis go bhfuair gach páirtí comhairle dlí ar leith

source: • Made with full disclosure of financial information
ga: • Déanta agus an fhaisnéis airgeadais a nochtadh go hiomlán

source: • Made not less than 28 days before the marriage
ga: • Déanta tráth nach lú ná 28 lá roimh an bpósadh

source: The report also recommended that pre-nuptial agreements be reviewable on death
ga: Ina theannta sin, moladh sa tuarascáil gur féidir athbhreithniú a dhéanamh ar chomhaontuithe réamhphósta ar bás duine

source: This is so that a court may make financial provision for a surviving spouse who may be unfairly affected by the provisions of a pre-nuptial agreement on the death of the other spouse in certain circumstances
ga: Is amhlaidh a socraíodh seo gur féidir le cúirt foráil airgeadais a dhéanamh le haghaidh céile marthanach a bhféadfadh difear a dhéanamh dó/di ag an gcomhaontú réamhphósta ar bás an chéile eile faoi chúinsí áirithe

source: The report’s recommendations have not yet been implemented
ga: Níor cuireadh i bhfeidhm moltaí na tuarascála go fóill
